In [1]:
import pandas as pd
import numpy as np

Q56. 데이터를 로드하고 데이터 행과 열의 갯수를 출력하라

In [2]:
Url = 'https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv'
df = pd.read_csv(Url)

In [3]:
df.shape[0], df.shape[1]

(10127, 19)

## Q57. Income_Category의 카테고리를 map 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라 

Unknown : N

Less than $40K : a

$40K - $60K : b

$60K - $80K : c

$80K - $120K : d

$120K +’ : e

In [4]:
df.head(2)

,Unnamed: 0,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt
0,0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144
1,1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291

### map(int, input().split())

### map(funcion, iterable)   함수, 데이터집합

In [5]:
list = {'Unknown' : 'N', 'Less than $40K' : 'a', '$40K - $60K' : 'b', '$60K - $80K' : 'c', 
        '$80K - $120K' : 'd', '$120K +' : 'e'}

In [9]:
df['newIncome'] = df.Income_Category.map(lambda x: list[x])
df.newIncome.head(3)

0    c
1    a
2    d
Name: newIncome, dtype: object

Q58. Income_Category의 카테고리를 apply 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑하라

In [13]:
df['newIncome2'] = df.Income_Category.apply(lambda x: 'N' if x=='Unknown' else 
                                            'a' if x=='Less than $40K' else 
                                            'b' if x=='$40K - $60K' else 
                                            'c' if x=='$60K - $80K' else 
                                            'd' if x=='$80K - $120K' else 'e')
df[['newIncome','newIncome2']].head()

  newIncome newIncome2
0         c          c
1         a          a
2         d          d
3         a          a
4         c          c

## Q59. Customer_Age의 값을 이용하여 나이 구간을 AgeState 컬럼으로 정의하라. <br> (0~9 : 0, 10~19 :10 , 20~29 :20 … 각 구간의 빈도수를 출력하라

In [28]:
df['AgeState'] = df.Customer_Age.apply(lambda x: 0 if x in np.arange(0,10)
                                      else 10 if x in np.arange(10,20)
                                      else 20 if x in np.arange(20,30)
                                      else 30 if x in np.arange(30,40)
                                      else 40 if x in np.arange(40,50)
                                      else 50 if x in np.arange(50,60)
                                      else 60 if x in np.arange(60,70)
                                      else 70)
df.groupby('AgeState').size()

AgeState
20     195
30    1841
40    4561
50    2998
60     530
70       2
dtype: int64

In [31]:
df.Customer_Age.map(lambda x: x//10 *10).value_counts().sort_index()

Customer_Age
20     195
30    1841
40    4561
50    2998
60     530
70       2
Name: count, dtype: int64

## Q60. Education_Level의 값중 Graduate단어가 포함되는 값은 1 그렇지 않은 경우에는 0으로 변경하여 newEduLevel 컬럼을 정의하고 빈도수를 출력하라

In [43]:
df.Education_Level.str.contains('Graduate').value_counts()

Education_Level
False    6483
True     3644
Name: count, dtype: int64

In [54]:
df['newEduLevel'] = df.Education_Level.apply(lambda x: 1 if 'Graduate' in x else 0)
df.newEduLevel.value_counts()

newEduLevel
0    6483
1    3644
Name: count, dtype: int64

In [56]:
df['newEduLevel2'] = df.Education_Level.map(lambda x: 1 if 'Graduate' in x else 0)
df[['newEduLevel','newEduLevel2']].head()

   newEduLevel  newEduLevel2
0            0             0
1            1             1
2            1             1
3            0             0
4            0             0

Q61. Credit_Limit 컬럼값이 4500 이상인 경우 1 그외의 경우에는 모두 0으로 하는 newLimit 정의하라. newLimit 각 값들의 빈도수를 출력하라

In [58]:
df['newLimit'] = df.Credit_Limit.map(lambda x: 1 if x>=4500 else 0)
df.newLimit.value_counts()

newLimit
1    5096
0    5031
Name: count, dtype: int64

## Q62. Marital_Status 컬럼값이 Married 이고 Card_Category 컬럼의 값이 Platinum인 경우 1 그외의 경우에는 모두 0으로 하는 newState컬럼을 정의하라. newState의 각 값들의 빈도수를 출력하라

### apply
- series 와 dataframe에서 lambda함수 사용가능
- row, column 전체가 움직이게 됨. 축 설정을 잘 해야 함

### applymap
- dataframe에서만 사용가능
- 접근하는 개체가 개별적임. 각 원소에 lambda를 적용

### map
- series에서만 사용가능
- dataframe에서는 join과 replace로 대체함

In [65]:
def check(x):
    if x.Marital_Status == 'Married' and x.Card_Category == 'Platinum':
        return 1
    else:
        return 0

df['newState'] = df.apply(check, axis = 1)
df.newState.value_counts()

newState
0    10120
1        7
Name: count, dtype: int64

Q63. Gender 컬럼값 M인 경우 male F인 경우 female로 값을 변경하여 Gender 컬럼에 새롭게 정의하라. 각 value의 빈도를 출력하라

In [67]:
df.loc[df.Gender == 'M', 'Gender'] = 'male'

In [68]:
df.loc[df.Gender == 'F', 'Gender'] = 'female'

In [69]:
df.Gender.value_counts()

Gender
female    5358
male      4769
Name: count, dtype: int64

Q64. 데이터를 로드하고 각 열의 데이터 타입을 파악하라

In [93]:
Url = 'https://raw.githubusercontent.com/Datamanim/pandas/main/timeTest.csv'
df = pd.read_csv(Url)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6574 entries, 0 to 6573
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Yr_Mo_Dy  6574 non-null   object
 1   RPT       6568 non-null   float64
 2   VAL       6571 non-null   float64
 3   ROS       6572 non-null   float64
 4   KIL       6569 non-null   float64
 5   SHA       6572 non-null   float64
 6   BIR       6574 non-null   float64
 7   DUB       6571 non-null   float64
 8   CLA       6572 non-null   float64
 9   MUL       6571 non-null   float64
 10  CLO       6573 non-null   float64
 11  BEL       6574 non-null   float64
 12  MAL       6570 non-null   float64
dtypes: float64(12), object(1)
memory usage: 667.8+ KB

Q65. Yr_Mo_Dy을 판다스에서 인식할 수 있는 datetime64타입으로 변경하라

In [94]:
df.Yr_Mo_Dy = df.Yr_Mo_Dy.astype('datetime64[ns]')

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6574 entries, 0 to 6573
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Yr_Mo_Dy  6574 non-null   datetime64[ns]
 1   RPT       6568 non-null   float64
 2   VAL       6571 non-null   float64
 3   ROS       6572 non-null   float64
 4   KIL       6569 non-null   float64
 5   SHA       6572 non-null   float64
 6   BIR       6574 non-null   float64
 7   DUB       6571 non-null   float64
 8   CLA       6572 non-null   float64
 9   MUL       6571 non-null   float64
 10  CLO       6573 non-null   float64
 11  BEL       6574 non-null   float64
 12  MAL       6570 non-null   float64
dtypes: datetime64[ns](1), float64(12)
memory usage: 667.8 KB

In [96]:
df.Yr_Mo_Dy.dtype

dtype('<M8[ns]')

In [97]:
df.Yr_Mo_Dy.dtype.str, df.Yr_Mo_Dy.dtype.type

('<M8[ns]', numpy.datetime64)

### Datetime타입으로 변환
① pd.to_datetime()  

② df['date'] = df['date'].astype('str')
<br> df['date'].apply(lambda _ : datetime.strptime(_,'%Y-%m-%d'))

### strftime : 시간을 문자열로

### strptime : 날짜,시간형식의 문자열을 datetime으로

In [98]:
pd.to_datetime(df.Yr_Mo_Dy)

0      2061-01-01
1      2061-01-02
2      2061-01-03
3      2061-01-04
4      2061-01-05
          ...
6569   1978-12-27
6570   1978-12-28
6571   1978-12-29
6572   1978-12-30
6573   1978-12-31
Name: Yr_Mo_Dy, Length: 6574, dtype: datetime64[ns]

66.Yr_Mo_Dy에 존재하는 년도의 유일값을 모두 출력하라

In [99]:
df.Yr_Mo_Dy.dt.year.unique()

array([2061, 2062, 2063, 2064, 2065, 2066, 2067, 2068, 2069, 2070, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978])

## Q67. Yr_Mo_Dy에 년도가 2061년 이상의 경우에는 모두 잘못된 데이터이다. 해당경우의 값은 100을 빼서 새롭게 날짜를 Yr_Mo_Dy 컬럼에 정의하라

In [103]:
import datetime as dt

In [105]:
date_fix = df.loc[df.Yr_Mo_Dy.dt.year>=2061, 'Yr_Mo_Dy']
date_fix.head(3)

0   2061-01-01
1   2061-01-02
2   2061-01-03
Name: Yr_Mo_Dy, dtype: datetime64[ns]

In [112]:
pd.concat([date_fix.dt.year-100, date_fix.dt.month, date_fix.dt.day], axis = 1).head(3)

   Yr_Mo_Dy  Yr_Mo_Dy  Yr_Mo_Dy
0      1961         1         1
1      1961         1         2
2      1961         1         3

In [124]:
def fix(x):
    year = x.year - 100 if x.year >= 2061 else x.year
    return pd.to_datetime(dt.date(year, x.month, x.day))

df['Yr_Mo_Dy'] = df['Yr_Mo_Dy'].apply(fix)
df.head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
0,1961-01-01,15.04,14.96,13.17,9.29,NaN,9.87,13.67,10.25,10.83,12.58,18.50,15.04
1,1961-01-02,14.71,NaN,10.83,6.50,12.62,7.67,11.50,10.04,9.79,9.67,17.54,13.83
2,1961-01-03,18.50,16.88,12.33,10.13,11.17,6.17,11.25,NaN,8.50,7.67,12.75,12.71

In [117]:
dt.date(2022, 3, 23), dt.time(9, 18, 33)

(datetime.date(2022, 3, 23), datetime.time(9, 18, 33))

In [120]:
dt.date(2022, 3, 23).strftime('%Y-%m-%d')

'2022-03-23'

Q68. 년도별 각컬럼의 평균값을 구하여라

In [125]:
df.head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
0,1961-01-01,15.04,14.96,13.17,9.29,NaN,9.87,13.67,10.25,10.83,12.58,18.50,15.04
1,1961-01-02,14.71,NaN,10.83,6.50,12.62,7.67,11.50,10.04,9.79,9.67,17.54,13.83
2,1961-01-03,18.50,16.88,12.33,10.13,11.17,6.17,11.25,NaN,8.50,7.67,12.75,12.71

In [130]:
df.groupby(df['Yr_Mo_Dy'].dt.year).mean().head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
Yr_Mo_Dy,,,,,,,,,,,,,
1961,1961-07-02,12.299583,10.351796,11.362369,6.958227,10.881763,7.729726,9.733923,8.858788,8.647652,9.835577,13.502795,13.680773
1962,1962-07-02,12.246923,10.110438,11.732712,6.960440,10.657918,7.393068,11.020712,8.793753,8.316822,9.676247,12.930685,14.323956
1963,1963-07-02,12.813452,10.836986,12.541151,7.330055,11.724110,8.434712,11.075699,10.336548,8.903589,10.224438,13.638877,14.999014

In [132]:
df.groupby(df.Yr_Mo_Dy.dt.year).mean().head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL
Yr_Mo_Dy,,,,,,,,,,,,,
1961,1961-07-02,12.299583,10.351796,11.362369,6.958227,10.881763,7.729726,9.733923,8.858788,8.647652,9.835577,13.502795,13.680773
1962,1962-07-02,12.246923,10.110438,11.732712,6.960440,10.657918,7.393068,11.020712,8.793753,8.316822,9.676247,12.930685,14.323956
1963,1963-07-02,12.813452,10.836986,12.541151,7.330055,11.724110,8.434712,11.075699,10.336548,8.903589,10.224438,13.638877,14.999014

Q69. weekday컬럼을 만들고 요일별로 매핑하라 ( 월요일: 0 ~ 일요일 :6)

In [137]:
df.Yr_Mo_Dy.dt.day_name().head(3)

0     Sunday
1     Monday
2    Tuesday
Name: Yr_Mo_Dy, dtype: object

In [140]:
df['weekday'] = df.Yr_Mo_Dy.dt.weekday
df.head(3)

,Yr_Mo_Dy,RPT,VAL,ROS,KIL,SHA,BIR,DUB,CLA,MUL,CLO,BEL,MAL,weekday
0,1961-01-01,15.04,14.96,13.17,9.29,NaN,9.87,13.67,10.25,10.83,12.58,18.50,15.04,6
1,1961-01-02,14.71,NaN,10.83,6.50,12.62,7.67,11.50,10.04,9.79,9.67,17.54,13.83,0
2,1961-01-03,18.50,16.88,12.33,10.13,11.17,6.17,11.25,NaN,8.50,7.67,12.75,12.71,1

## dt.day_name() : 요일이름

## dt.weekday : 요일 number

Q70. weekday컬럼을 기준으로 주말이면 1 평일이면 0의 값을 가지는 WeekCheck 컬럼을 만들어라

In [146]:
df['WeekCheck'] = df.weekday.apply(lambda x: 1 if x in (6,7) else 0)

In [147]:
df.WeekCheck.head(3)

0    1
1    0
2    0
Name: WeekCheck, dtype: int64